Panadas- DataFrame and series 
Pandas is a powerful data manipulation library in Python,widely used for data analysis and data cleaning. It Provides two primary data structure:Series and DataFrame.A Series is a one-dimensional array like object while DataFrame is a two- dimensional,size-mutable,and potentionally hetrogenous tubular data structure with labled axes(row and columns)

In [1]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Collecting pandas
  Downloading pandas-2.3.1-cp313-cp313-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\acer-user\appdata\roaming\python\python313\site-packages (from pandas) (2.3.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\acer-user\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\acer-user\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.1-cp313-cp313-win_amd64.whl (11.0 MB)
   ---------------------------------------- 0.0/11.0 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.0 MB ? eta -:--:--
    --------------------------------------- 0.3/11.0 MB ? eta -:--:--
   - -------------------------------------- 0.5/11.0 MB 813.3 kB/s eta 0:00:13
   - -------------------------------------- 0.5/11.0 MB 813.3 kB/s eta 0:00:13
   -- ------------------------------------- 0.8/11.0 MB 734.3 kB/s eta 0:00:14
   -- ------------------------------------- 0.8/11.0 MB 734.3 kB/s eta 0:00:14
   -- ------------------------------------- 0.8/11.0 MB 734.3 kB/s eta 0:00:14
   --- ------------------------------------ 1.0/11.0 MB 649.1 kB/s eta 0:00:16
   ---- ----------------------------------- 1.3/11.0 MB 707.0 kB/s eta 0:00:14
   ----- ---------------------------------- 1.6/11.0 MB 759.9 kB/s eta 0:00:13
   ----- ---------------------------------- 1.6/11.0 MB 759.9 kB/s eta 0:00:13
   ------- -------------------------------- 2.1/11.0 MB 823.8 kB/s eta 0:00:11
   -------- ------------------------------- 2.4/11.0 MB 857.0 kB/s eta 0:00:11
   -------- ------------------------------- 2.4/11.0 MB 857.0 kB/s eta 0:00:11
   --------- ------------------------------ 2.6/11.0 MB 868.2 kB/s eta 0:00:10
   ---------- ----------------------------- 2.9/11.0 MB 892.4 kB/s eta 0:00:10
   ---------- ----------------------------- 2.9/11.0 MB 892.4 kB/s eta 0:00:10
   ----------- ---------------------------- 3.1/11.0 MB 848.8 kB/s eta 0:00:10
   ------------ --------------------------- 3.4/11.0 MB 853.3 kB/s eta 0:00:09
   ------------- -------------------------- 3.7/11.0 MB 878.2 kB/s eta 0:00:09
   ------------- -------------------------- 3.7/11.0 MB 878.2 kB/s eta 0:00:09
   --------------- ------------------------ 4.2/11.0 MB 899.4 kB/s eta 0:00:08
   ---------------- ----------------------- 4.5/11.0 MB 925.6 kB/s eta 0:00:08
   ------------------ --------------------- 5.0/11.0 MB 978.2 kB/s eta 0:00:07
   ------------------ --------------------- 5.0/11.0 MB 978.2 kB/s eta 0:00:07
   ------------------- -------------------- 5.2/11.0 MB 959.5 kB/s eta 0:00:06
   ------------------- -------------------- 5.2/11.0 MB 959.5 kB/s eta 0:00:06
   -------------------- ------------------- 5.8/11.0 MB 965.3 kB/s eta 0:00:06
   --------------------- ------------------ 6.0/11.0 MB 979.0 kB/s eta 0:00:06
   ---------------------- ----------------- 6.3/11.0 MB 992.8 kB/s eta 0:00:05
   ----------------------- ---------------- 6.6/11.0 MB 1.0 MB/s eta 0:00:05
   ------------------------ --------------- 6.8/11.0 MB 1.0 MB/s eta 0:00:05
   -------------------------- ------------- 7.3/11.0 MB 1.0 MB/s eta 0:00:04
   --------------------------- ------------ 7.6/11.0 MB 1.1 MB/s eta 0:00:04
   ----------------------------- ---------- 8.1/11.0 MB 1.1 MB/s eta 0:00:03
   ------------------------------ --------- 8.4/11.0 MB 1.1 MB/s eta 0:00:03
   ------------------------------- -------- 8.7/11.0 MB 1.1 MB/s eta 0:00:03
   --------------------------------- ------ 9.2/11.0 MB 1.1 MB/s eta 0:00:02
   ---------------------------------- ----- 9.4/11.0 MB 1.1 MB/s eta 0:00:02
   ----------------------------------- ---- 9.7/11.0 MB 1.2 MB/s eta 0:00:02
   ------------------------------------ --- 10.0/11.0 MB 1.2 MB/s eta 0:00:01
   ------------------------------------- -- 10.2/11.0 MB 1.2 MB/s eta 0:00:01
   ---------------------------------------  10.7/11.0 MB 1.2 MB/s eta 0:00:01
   ---------------------------------------- 11.0/11.0 MB 1.2 MB/s eta 0:00:00
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.3.1 pytz-2025.2 tzdata-2025.2
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [1]:
pip install numpy

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: numpy in c:\users\acer-user\appdata\roaming\python\python313\site-packages (2.3.1)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

In [5]:
#Series 
# pandas series is a one-dimensional array like object that can hold any data type. it is similar to a column in a table 
import pandas as pd
data = [1,2,3,4,5]
series = pd.Series(data)
print("series \n",series)
print(type(series))

series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [6]:
## Create a series from a dictionary 
data= {'a' :1,'b':2,'c':3}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [8]:
data = [10,20,30]
index = ['a','b','c']
pd.Series(data,index = index)

a    10
b    20
c    30
dtype: int64

In [ ]:
##DataFrame
 #create a DataFrame from a dictionary of list 
data = {
    'Name' : ['kanhaiya','john','Jack'],
    'Age' : [25,30,45],
    'City' : ['Banglore','New Delhi','new York']
}
df = pd.DataFrame(data)
print(df)
print(type(df))

       Name  Age       City
0  kanhaiya   25   Banglore
1      john   30  New Delhi
2      Jack   45   new York

In [10]:
import numpy as np 
np.array(df)

array([['kanhaiya', 25, 'Banglore'],
       ['john', 30, 'New Delhi'],
       ['Jack', 45, 'new York']], dtype=object)

In [13]:
##create a dataFrame from a list of a Dictionaries
data = [
    {'name':'Krish','Age' : 32 ,'City' : 'Banglore'},
        {'name':'Krish','Age' : 32 ,'City' : 'Banglore'},
            {'name':'Krish','Age' : 32 ,'City' : 'Banglore'},
]
df = pd.DataFrame(data)
print(df)
print(type(df))

    name  Age      City
0  Krish   32  Banglore
1  Krish   32  Banglore
2  Krish   32  Banglore
<class 'pandas.core.frame.DataFrame'>

In [15]:
df = pd.read_csv('sales_data.csv')
(df.head(5))

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [16]:
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [18]:
##Accessing data from DataFrame
data
print(df)

     Transaction ID        Date Product Category  \
0             10001  2024-01-01      Electronics
1             10002  2024-01-02  Home Appliances
2             10003  2024-01-03         Clothing
3             10004  2024-01-04            Books
4             10005  2024-01-05  Beauty Products
..              ...         ...              ...
235           10236  2024-08-23  Home Appliances
236           10237  2024-08-24         Clothing
237           10238  2024-08-25            Books
238           10239  2024-08-26  Beauty Products
239           10240  2024-08-27           Sports

                                        Product Name  Units Sold  Unit Price  \
0                                      iPhone 14 Pro           2      999.99
1                                   Dyson V11 Vacuum           1      499.99
2                                   Levi's 501 Jeans           3       69.99
3                                  The Da Vinci Code           4       15.99
4                            Neutrogena Skincare Set           1       89.99
..                                               ...         ...         ...
235  Nespresso Vertuo Next Coffee and Espresso Maker           1      159.99
236                        Nike Air Force 1 Sneakers           3       90.00
237           The Handmaid's Tale by Margaret Atwood           3       10.99
238             Sunday Riley Luna Sleeping Night Oil           1       55.00
239                       Yeti Rambler 20 oz Tumbler           2       29.99

     Total Revenue         Region Payment Method
0          1999.98  North America    Credit Card
1           499.99         Europe         PayPal
2           209.97           Asia     Debit Card
3            63.96  North America    Credit Card
4            89.99         Europe         PayPal
..             ...            ...            ...
235         159.99         Europe         PayPal
236         270.00           Asia     Debit Card
237          32.97  North America    Credit Card
238          55.00         Europe         PayPal
239          59.98           Asia    Credit Card

[240 rows x 9 columns]

In [20]:
data = {
    'Name' : ['kanhaiya','john','Jack'],
    'Age' : [25,30,45],
    'City' : ['Banglore','New Delhi','new York']
}
df = pd.DataFrame(data)
print(df)
print(type(df))

       Name  Age       City
0  kanhaiya   25   Banglore
1      john   30  New Delhi
2      Jack   45   new York
<class 'pandas.core.frame.DataFrame'>

In [21]:
df

       Name  Age       City
0  kanhaiya   25   Banglore
1      john   30  New Delhi
2      Jack   45   new York

In [23]:
df['Name']

0    kanhaiya
1        john
2        Jack
Name: Name, dtype: object

In [24]:
df.loc[0]

Name    kanhaiya
Age           25
City    Banglore
Name: 0, dtype: object

In [27]:
df.iloc[0]

Name    kanhaiya
Age           25
City    Banglore
Name: 0, dtype: object

In [26]:
df.iloc[0][0]

C:\Users\acer-user\AppData\Local\Temp\ipykernel_6708\2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'kanhaiya'

In [28]:
df

       Name  Age       City
0  kanhaiya   25   Banglore
1      john   30  New Delhi
2      Jack   45   new York

In [30]:
print(df.at[1,'Age'])

30

In [31]:
df.iat[2,2]

'new York'

In [32]:
##Data manipulation with DataFrame
df

       Name  Age       City
0  kanhaiya   25   Banglore
1      john   30  New Delhi
2      Jack   45   new York

In [38]:
##Adding a Column here
df['Salary'] = [50000,60000,70000]
df

       Name  Age       City  Salary
0  kanhaiya   25   Banglore   50000
1      john   30  New Delhi   60000
2      Jack   45   new York   70000

In [41]:
##Remove a column
df.drop('Salary',axis =1)

       Name  Age       City
0  kanhaiya   25   Banglore
1      john   30  New Delhi
2      Jack   45   new York

In [44]:
df.drop('Salary',axis =1,inplace =True)

KeyError: "['Salary'] not found in axis"

In [45]:
df

       Name  Age       City
0  kanhaiya   25   Banglore
1      john   30  New Delhi
2      Jack   45   new York

In [46]:
##Add age to the column
df['Age'] = df['Age']+1
df

       Name  Age       City
0  kanhaiya   26   Banglore
1      john   31  New Delhi
2      Jack   46   new York

In [47]:
df.drop(0,inplace = True)

In [48]:
df

   Name  Age       City
1  john   31  New Delhi
2  Jack   46   new York

In [49]:
df = pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [ ]:
##Display the data type of each column 
# print("Data types:\n",df.types)
##Describe the DataFrame 
print("Statical sumaary is \n",df.describe())


# print("mean value by category:\n",grouped)

Statical sumaary is
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [56]:
df
##Group by a column and perform an aggregation 
grouped = df.groupby('Category')['value'].mean()

KeyError: 'Category'